In [2]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [8]:
base_path='D:/TA COK/TA 2/New Prob/Book Crossing With Users Review Rating/Book reviews/Book reviews'
#error_bad_lines=False (Skip line yang rusak) 
#encoding='ISO-8859-1' (Decode error utf-8 codex)
Books_df = pd.read_csv('{}/BX_Books.csv'.format(base_path), sep=";", encoding='CP1252', escapechar='\\')
Rates_df = pd.read_csv('{}/BX-Book-Ratings.csv'.format(base_path), sep=";", encoding='CP1252', escapechar='\\')
Users_df = pd.read_csv('{}/BX-Users.csv'.format(base_path), sep=";", encoding='CP1252', escapechar='\\')

Users_df.head(10)

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN
5        6       santa monica, california, usa  61.0
6        7                 washington, dc, usa   NaN
7        8            timmins, ontario, canada   NaN
8        9          germantown, tennessee, usa   NaN
9       10          albacete, wisconsin, spain  26.0

Melakukan cleanup, limitasi user berdasar umur, dan pemberian nilai rata rata pada cell yang kosong pada kolom tabel.

In [11]:
fix_users_age = Users_df[Users_df.Age > 0]
fix_users_age = Users_df[Users_df.Age < 50]
Users_df['Age'].fillna(fix_users_age['Age'].mean())
Users_df = Users_df[Users_df.Age < 50]
Users_df = Users_df[Users_df.Age > 6]

Users_df.head(10)

    User-ID                                Location   Age
1         2               stockton, california, usa  18.0
3         4               porto, v.n.gaia, portugal  17.0
9        10              albacete, wisconsin, spain  26.0
10       11          melbourne, victoria, australia  14.0
12       13             barcelona, barcelona, spain  26.0
17       18  rio de janeiro, rio de janeiro, brazil  25.0
18       19                               weston, ,  14.0
19       20            langhorne, pennsylvania, usa  19.0
20       21          ferrol / spain, alabama, spain  46.0
23       24                   cologne, nrw, germany  19.0

In [13]:
print(f" Dan umur rata-rata dari user adalah {fix_users_age['Age'].mean():.2f}")

 Dan umur rata-rata dari user adalah 30.18

Penggabungan table buku, rating, dan user. Lalu melakukan pembersihan duplikat data dan menghitung rating buku.

In [15]:
fix_rating_book = Rates_df.drop_duplicates()
fix_rating_book = fix_rating_book[fix_rating_book['Book-Rating'] > 0]

Book_All = pd.merge(fix_rating_book, Books_df, how='inner').merge(fix_users_age, how='inner')
Book_All = Book_All.drop_duplicates()
Book_All = Book_All.drop(columns=['Image-URL-S', 'Image-URL-M', 'Image-URL-L', 'Location'])
Book_All = Book_All.rename(columns={"User-ID": "User ID", "Book-Rating": "Book Rating", "Book-Author": "Book Author", "Book-Title": "Book Title","Year-Of-Publication": "Publication Year"})
Book_All = Book_All['Book Author'].str.title()

Book_All.head(10)

0      Philip Prowse
1        Sue Leather
2       John Grisham
3     Dean R. Koontz
4       Stephen King
5        Mitch Albom
6       Erma Bombeck
7            Jenkins
8    Gyles Brandreth
9       Daniel Keyes
Name: Book Author, dtype: object